In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as mpl
import matplotlib.pyplot as plt

%matplotlib inline
pd.options.display.max_rows = 10
plt.style.use("ggplot")
mpl.rcParams["axes.unicode_minus"] = False
plt.rcParams["font.size"] = 12
plt.rcParams["font.family"] = 'NanumGothic'

train_df = pd.read_csv('/home/yahwang/elice/titanic_train.csv')

## 데이터 슬라이싱

In [2]:
sliced_df = train_df.head(10).copy()
sliced_df.index = ['a','b','c','d','e','f','g','h','i','j']
sliced_df.PassengerId = range(10)
sliced_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
a,0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
b,1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
c,2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
d,3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
e,4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
f,5,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
g,6,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
h,7,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
i,8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
j,9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

* ### loc : row - index값 기준, column- column명 기준

In [3]:
sliced_df.loc[ ['d','h','i'], ['PassengerId','Pclass','Name'] ]

   PassengerId  Pclass                                               Name
d            3       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
h            7       3                     Palsson, Master. Gosta Leonard
i            8       3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)

* ### iloc : row & column - 위치에 해당하는 정수값으로 대체

In [4]:
# 컬럼도 0부터 정수 index로
# passengerId가 index의 정수값을 의미
sliced_df.iloc[ 3:8, [0,2,3]]

   PassengerId  Pclass                                          Name
d            3       1  Futrelle, Mrs. Jacques Heath (Lily May Peel)
e            4       3                      Allen, Mr. William Henry
f            5       3                              Moran, Mr. James
g            6       1                       McCarthy, Mr. Timothy J
h            7       3                Palsson, Master. Gosta Leonard

* ### xs : cross-section 주로 multiindex 슬라이싱에 유용

In [5]:
# 일반 슬라이싱
sliced_df.xs('e') # row index 기준
# sliced_df.xs('Pclass', axis=1) # 컬럼 기준

PassengerId                           4
Survived                              0
Pclass                                3
Name           Allen, Mr. William Henry
Sex                                male
                         ...
Parch                                 0
Ticket                           373450
Fare                               8.05
Cabin                               NaN
Embarked                              S
Name: e, Length: 12, dtype: object

#### **Multiindex 슬라이싱**

In [6]:
multiindex_df = sliced_df.groupby(['Sex','Pclass'])[['Age','Fare']].mean()
multiindex_df

                     Age       Fare
Sex    Pclass
female 1       36.500000  62.191650
       2       14.000000  30.070800
       3       26.500000   9.529150
male   1       54.000000  51.862500
       3       19.666667  11.208325

In [7]:
# 하나의 index 컬럼 중 특정 value를 선택해서 슬라이싱 가능 
multiindex_df.xs(key='female', level='Sex' ,drop_level=True)

         Age      Fare
Pclass
1       36.5  62.19165
2       14.0  30.07080
3       26.5   9.52915

In [8]:
# 두 가지 index 중 선택 ( tuple )
multiindex_df.xs( ('female',1), drop_level=True)

Age     36.50000
Fare    62.19165
Name: (female, 1), dtype: float64

* ### at : single value

In [9]:
sliced_df.at['h', 'Pclass']

3